In [2]:
import pandas as pd

1. Value_counts( )

In [ ]:
# value_counts() — Frequency Count
df = pd.DataFrame({
   "department": ["IT","HR","IT","Finance","HR","IT","Finance"] 
})
print(df.value_counts())

department
IT            3
Finance       2
HR            2
Name: count, dtype: int64

In [ ]:
# Percentage Distribution
df["department"].value_counts(normalize=True) * 100

department
IT         42.857143
HR         28.571429
Finance    28.571429
Name: proportion, dtype: float64

In [6]:
# Top N Values
df["department"].value_counts().head(2)

department
IT    3
HR    2
Name: count, dtype: int64

In [ ]:
df["department"].value_counts(dropna=False)
# including missing values

department
IT         3
HR         2
Finance    2
Name: count, dtype: int64

In [ ]:
age = pd.Series([21,22,23,25,30,35,40,45])
age.value_counts(bins=3)
# Bins (Numeric Data)

(20.974999999999998, 29.0]    4
(29.0, 37.0]                  2
(37.0, 45.0]                  2
Name: count, dtype: int64

2. crosstab() — Two Column Frequency Relationship

In [9]:
sales_df = pd.DataFrame({
    "OrderID": [1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012],
    "Customer": ["Arman","Riya","Kunal","Sneha","Vikram","Pooja","Rahul","Neha","Arjun","Simran","Aman","Zoya"],
    "City": ["Delhi","Mumbai","Delhi","Pune","Mumbai","Delhi","Pune","Delhi","Mumbai","Pune","Delhi","Mumbai"],
    "Category": ["Electronics","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics","Furniture","Clothing","Electronics"],
    "Amount": [25000,3000,18000,22000,4500,27000,15000,3500,20000,24000,3200,26000],
    "Quantity": [1,2,1,1,3,1,2,2,1,1,2,1],
    "PaymentMode": ["UPI","Card","UPI","Cash","Card","UPI","Cash","UPI","Card","Cash","Card","UPI"]
})
sales_df

    OrderID Customer    City     Category  Amount  Quantity PaymentMode
0      1001    Arman   Delhi  Electronics   25000         1         UPI
1      1002     Riya  Mumbai     Clothing    3000         2        Card
2      1003    Kunal   Delhi  Electronics   18000         1         UPI
3      1004    Sneha    Pune    Furniture   22000         1        Cash
4      1005   Vikram  Mumbai     Clothing    4500         3        Card
5      1006    Pooja   Delhi  Electronics   27000         1         UPI
6      1007    Rahul    Pune    Furniture   15000         2        Cash
7      1008     Neha   Delhi     Clothing    3500         2         UPI
8      1009    Arjun  Mumbai  Electronics   20000         1        Card
9      1010   Simran    Pune    Furniture   24000         1        Cash
10     1011     Aman   Delhi     Clothing    3200         2        Card
11     1012     Zoya  Mumbai  Electronics   26000         1         UPI

In [12]:
pd.crosstab(sales_df["PaymentMode"],sales_df["City"])

City         Delhi  Mumbai  Pune
PaymentMode
Card             1       3     0
Cash             0       0     3
UPI              4       1     0

In [18]:
# Normalize Crosstab (Percentage)
pd.crosstab(sales_df["City"],sales_df["Category"],normalize=True) * 100

Category   Clothing  Electronics  Furniture
City
Delhi     16.666667    25.000000        0.0
Mumbai    16.666667    16.666667        0.0
Pune       0.000000     0.000000       25.0

In [20]:
# Add Totals
pd.crosstab(sales_df["City"],sales_df["Category"],margins=True)

Category  Clothing  Electronics  Furniture  All
City
Delhi            2            3          0    5
Mumbai           2            2          0    4
Pune             0            0          3    3
All              4            5          3   12

In [25]:
# Crosstab With Aggregation ( Powerful)
pd.crosstab(sales_df["City"],sales_df['Category'],values = sales_df["Amount"],aggfunc="mean").fillna(0)
# city and category wise avg selling ammount

Category  Clothing   Electronics     Furniture
City
Delhi       3350.0  23333.333333      0.000000
Mumbai      3750.0  23000.000000      0.000000
Pune           0.0      0.000000  20333.333333